local MESSAGE_CONFIG = {
	msgtype = {
		[1] = {
			id = "101",
			[1] = { a ="1", b = "【牌友邀請】你的好友{nick} 邀請你來參加德州撲克淘汰賽，趕緊來參加吧！" };
			[2] = { a ="2", b = "【新增牌友】你的好友{nick} 通過你的邀請安裝了德州撲克，恭喜你獲得了20000籌碼的獎勵！" };
			[3] = { a ="3", b = "【新增牌友】{nick} 已加你為牌友！" };
			[4] = { a ="4", b = "你的好友{nick} 接受了你從大廳發出的好友邀請並成功安裝了遊戲，你獲贈20000 Chips。" };
			[5] = { a ="5", b = "你的好友{nick}接受了你從每日登錄處的好友邀請，並成功安裝了遊戲，你額外獲贈每日登錄獎勵200 chips。" };
			[6] = { a ="6", b = "恭喜你！你的好友{nick}接受了你從牌桌上發出的好友邀請並成功安裝了遊戲，你獲贈20000 Chips。" };
			[7] = { a ="7", b = "恭喜你！你從幸運禮盒處成功邀請了1位好友安裝了遊戲，還需2位好友方可開啟禮盒，獲得30K！" };
			[8] = { a ="8", b = "恭喜你！你從幸運禮盒處成功邀請了2位好友安裝了遊戲，還需1位好友方可開啟禮盒，獲得30K！" };
			[9] = { a ="9", b = "恭喜你！你從幸運禮盒處邀請成功了3位好友安裝了遊戲，你獲贈30000 Chips。" };
			[10] = { a ="10", b = "恭喜你！你的好友{nick}接受了你從大轉盤處發出的好友邀請並成功安裝了遊戲，你終身額外獲贈1次玩大轉盤的機會。" };
			[11] = { a ="11", b = "恭喜你！你於{month}月{day}號投注的{min}開獎的撲克彩票中獎了，獎金為{money}籌碼，兌獎有效期為7天，快去領獎吧！" };
			[12] = { a ="10026", b = "您的好友{nick}邀请您打牌，赶紧加入吧！" };
			[13] = { a ="10002", b = "【牌友邀請】恭喜妳，成功邀請好友{nick}登錄獲得{chips}籌碼" };
		};
		[2] = {
			id = "102",
			[1] = { a ="1", b = "【收到禮物】你的好友{nick} 贈送給你一份禮物{gift}，快來看一下吧！" };
			[2] = { a ="2", b = "【收到道具】你的好友{nick} 贈送給你道具{props}，快來看一下吧！" };
			[3] = { a ="3", b = "【收到玩偶】你的好友{nick} 贈送給你一個卡拉幸運星座玩偶：{toyname}！" };
			[4] = { a ="10", b = "你成功召回一個好友，得到{reward}籌碼" };
			[5] = { a ="21", b = "【收到禮物】好友{from} 給你贈送貓女郎愛心，快來看看吧！" };
			[6] = { a ="22", b = "【贈送禮物】你贈送給你的好友 {unit} 顆貓女郎愛心！" };
			[7] = { a ="10010", b = "恭喜从好友{nick}处获得{chips}游戏币！" };
		};
		[3] = {
			id = "103",
			[1] = { a ="1", b = "【索要禮物】你的好友{nick} 向你索要禮物{gift}，價格{price}，快來慷慨解囊吧！" };
			[2] = { a ="2", b = "【索要道具】你的好友{nick} 向你索要道具{props}，價格{price}，快來慷慨解囊吧！" };
			[3] = { a ="3", b = "你的好友 {nick} 向您索要玩偶{gift}，快来慷慨解囊吧！" };
			[4] = { a ="21", b = "你的好友{name}送你一些心，快去看看吧！" };
		};
		[4] = {
			id = "104",
			[1] = { a ="1", b = "【贈送籌碼】恭喜您領取到了好友{nick}贈送的{chips}籌碼，祝您遊戲愉快！" };
			[2] = { a ="2", b = "【贈送籌碼】您的好友{nick}已經成功領取到您贈送的{chips}籌碼，祝您遊戲愉快！" };
		};
		[5] = {
			id = "201",
			[1] = { a ="1", b = "為了回饋廣大玩家，德州撲克專業版提高了等級獎勵，系統給你補償等級獎勵{coalaa}金幣,具體請去等級頁面查看！" };
			[2] = { a ="2", b = "尊敬的德州撲克玩家，感謝你對我們的支持，粉絲頁點贊活動獎勵{chips} 籌碼已發放，請注意查收，謝謝！" };
			[3] = { a ="3", b = "由於系統升級，比賽期間給你帶來不便敬請諒解。系統給你贈送免費籌碼10萬，請查收，謝謝！" };
			[4] = { a ="5", b = "歡迎您回到遊戲，系統贈送你{chips}, 請查收，謝謝！" };
			[5] = { a ="10", b = "恭喜您！您被選中為德州撲克專業版粉絲頁分享帖子活動的幸運粉絲。獲得{chips}籌碼！" };
			[6] = { a ="11", b = "由於系統升級，遊戲期間給你帶來不便敬請諒解。系統給你贈送免費籌碼{chips}，請查收，謝謝！" };
			[7] = { a ="107", b = "親愛的玩家，您好，感謝對遊戲的支持，通過參與農場活動系統給您免費贈送{chips}籌碼，祝遊戲愉快，謝謝！" };
			[8] = { a ="109", b = "親愛的玩家，您好，感謝對遊戲的支持，系統給您免費贈送{chips}籌碼，祝遊戲愉快，謝謝！" };
			[9] = { a ="110", b = "感謝您的支持，對於前天某個玩家問題導致的籌碼計算錯誤，經系統核實，現給您發放{chips}籌碼的補償，請您查收。祝您遊戲愉快！" };
			[10] = { a ="111", b = "感謝您的反饋，現為您轉入300k籌碼作為補償，請您查收。祝您遊戲愉快！" };
			[11] = { a ="112", b = "感謝您參與我們官方塗鴉墻的互動，現系統為您贈送500籌碼作為獎勵，祝您遊戲愉快！" };
			[12] = { a ="113", b = "由於系統升級維護，導致部分玩家遊戲期間受到影響，對此我們深表歉意。為感謝您對遊戲的支持，系統為您補發一天的VIP登錄獎勵{chips}籌碼，祝遊戲愉快！" };
			[13] = { a ="114", b = "由于我们要更新系统，你会遇到储值的问题。很抱歉造成各位困扰。目前我们已经补偿给各位30% {chips}。请检查一下。感谢您的支持。"};
			[14] = { a ="115", b = "親愛的玩家，您好，感謝對遊戲的支持，通過參與{name}活動第{rank}名系統給您獎勵{reward}，請注意查收，謝謝！" };
			[15]= {a="1000", b="【{rtime}】{reason}"};
			[16] = { a ="1000001", b = "测试模板，请忽略！" };
		};
		[6] = {
			id = "202",
			[1] = { a ="1", b = "你的牌友{nick} 在你的呼喚下重回游戲了，你獲得了2000籌碼獎勵！" };
			[2] = { a ="2", b = "親愛的{nick} 歡迎你回來游戲，送你{chips} 籌碼，祝你玩的開心！" };
		};
		[7] = {
			id = "203",
			[1] = { a ="1", b = "【客服反饋】你的提交反饋我們已經處理，感謝你對我們的支持。詳情請前往\"反饋\"查看。" };
		};
		[8] = {
			id = "204",
			[1] = { a ="1", b = "{nick}在你的邀請下加入了遊戲，恭喜你現在已經可以打開禮盒了！" };
		};
		[9] = {
			id = "205",
			[1] = { a ="1", b = "在好友的幫助下，你已經可以打開彩蛋了，快看看裡面有什麼吧！" };
		};
		[10] = {
			id = "206",
			[1] = { a ="1", b = "{nick} 在你的邀請下加入了遊戲，你獲得了20000籌碼獎勵。" };
			[2] = { a ="2", b = "成功獲取了{nick}發布的{chips}籌碼。" };
			[3] = { a ="3", b = "{nick}領取了你發布的幸運籌碼。" };
			[4] = { a ="4", b = "{nick}在你的邀請下加入了遊戲，你每日額外增加一次的大轉盤機會。" };
			[5] = { a ="5", b = "{nick}在你的邀請下加入了遊戲，再邀請{lnum}個好友就可以打開禮盒領取豐厚獎勵了哦。" };
			[6] = { a ="6", b = "再接再勵,只要再獲得{lnum}個好友的幫助，就可以打開彩蛋獲得獎勵了哦！" };
			[7] = { a ="7", b = "你的牌友{nick} 在你的呼喚下重回游戲了，你獲得了{chips}籌碼獎勵。" };
			[8] = { a ="8", b = "親愛的{nick}，歡迎你回來游戲，送你{chips}籌碼，祝你玩的開心！" };
			[9] = { a ="9", b = "恭喜您成功獲得了{chips}的粉絲獎勵" };
			[10] = { a ="10", b = "您好：系統給您發放{chips}籌碼, 請注意查收！" };
			[11] = { a ="11", b = "您好：系統給您發放{coalaa}金幣, 請注意查收！" };
			[12] = { a ="12", b = "您好：系統給您增加{exp}經驗值，請注意查收！" };
			[13] = { a ="13", b = "很遺憾，粉絲獎勵已被搶完啦！" };
			[14] = { a ="14", b = "{nick}在您的邀請下進入的遊戲，你獲得了聖誕水壺1個" };
			[15] = { a ="15", b = "{nick}在您的邀請下進入的遊戲，你獲得了錘子1個" };
			[16] = { a ="16", b = "親愛的玩家，歡迎您進入體驗我們的新版本，我們為您準備了200K籌碼，祝您遊戲愉快！" };
			[17] = { a ="17", b = "恭喜你參加一鍵分享活動獲得500籌碼， 祝你玩得開心~" };
			[18] = { a ="18", b = "親愛的玩家，您獲得了首充大禮包一個，內含：VIP銅卡體驗5天、互動道具30個數、雙倍經驗卡5張、積分200、經驗值（EXP）500、小喇叭10個。祝您遊戲愉快！" };
			[19] = { a ="19", b = "恭喜您成功獲得了{fun}个互動道具的粉絲獎勵" };
			[20] = { a ="20", b = "恭喜您成功獲得了{vip}天vip銅卡的粉絲獎勵" };
			[21] = { a ="21", b = "恭喜您成功獲得了一張20%Off卡的粉絲獎勵" };
			[22] = { a ="102", b = "由於系統升級維護，導致部分玩家遊戲期間受到影響，對此我們深表歉意，為感謝您對遊戲的支持，系統給您贈送{chips}，祝遊戲愉快！" };
			[23] = { a ="103", b = "由於系統升級維護，導致部分玩家遊戲在比賽中受到影響，對此我們深表歉意，系統給您退還報名費用{chips}，祝遊戲愉快！" };
			[24] = { a ="104", b = "親愛的玩家朋友，德州撲克專業版歡迎您回來，我們為您準備了{desc}，助您再次稱霸牌桌！" };
			[25] = { a ="105", b = "德州撲克專業版歡迎您回來！系統為您準備了{desc}，助您重新開啟撲克榮耀之旅！" };
			[26] = { a ="200", b = "恭喜你達到條件，獲得了{msg}稱號" };
			[27] = { a ="201", b = "恭喜你！你於{month}月{day}號投注的{min}開獎的撲克彩票中獎了，獎金為{money}籌碼，兌獎有效期為7天，快去領獎吧！" };
			[28] = { a ="202", b = "恭喜你，玩牌25局獲得了瓶蓋{caps}！" };
			[29] = { a ="10004", b = "系统刚给您赠送{chips}筹码，请您确认。祝您好运！" };
			[30] = { a ="10005", b = "经过您的努力，您已经获得了成就：{achi}。" };
			[31] = { a ="10006", b = "经过您的努力，您达到了{level}级。" };
			[32] = { a ="10007", b = "欢饮您成为德州扑克专业版俱乐部的新成员。为了感谢您对游戏支持，您将享受三天的额外的登录奖励！" };
			[33] = { a ="10002", b = "恭喜您{nick}在寻找大赢家活动中获得第{rank}名 获得筹码{chips}加油哦" };
			[34] = { a ="10003", b = "恭喜您{nick}游客账号成功升级卡拉账号,获得筹码{money}" };
			[35] = { a ="10008", b = "欢迎来到移动，系统已为您发送{chips}筹码" };
			[36] = { a ="10009", b = "您成功召回了牌友{nick}, 获得了{chips}筹码的奖励." };
			[37] = { a ="22", b = "游戏将于{date}停服升级，给您带来不便望谅解" };
			[38] = { a ="25", b = "系统给赠送一份情人节礼物《钻石玫瑰》，请到“我的礼物”中查收，祝您情人节快乐！" };
			[39] = { a ="206", b = "成功领取钻石大赢家奖励:{}" };
			[40] = { a ="10010", b = "成功领取钻石大赢家奖励:{}" };
			[41] = { a ="10011", b = "恭喜您成功获得钻石大赢家排行榜奖励：{}" };
			[42] = { a ="10012", b = "您于{date}獲得登陸獎勵{chips}籌碼" };
			[43] = { a ="10013", b = "欢迎您成为德州扑克专业版俱乐部的新成员，我们提供给您注册奖励{msg}" };
			[44] = { a ="10014", b = "领取彩票奖励:{chips}筹码" };
			[45] = { a ="10015", b = "领取大转盘奖励：{chips}筹码" };
			[46] = { a ="10000", b = "{msg}" };
			[47] = { a ="10016", b = "【每日登录】领取{chips}筹码的玩牌奖励" };
			[48] = { a ="10017", b = "【每日登录】领取{chips}筹码的签到奖励" };
			[49] = { a ="10018", b = "【每日登录】领取{chips}筹码的VIP奖励" };
			[50] = { a ="10019", b = "【每日登录】领取{chips}筹码的网页版签到奖励" };
			[51] = { a ="10020", b = "【每日登录】领取{chips}筹码的facebook奖励" };
			[52] = { a ="10021", b = "【排行榜奖励】获得排行榜第{rank}名,奖励{msg}" };
			[53] = { a ="10022", b = "充值特别优惠1M筹码+15道具系统已发放，请查收" };
			[54] = { a ="10023", b = "您于{date}获得老虎机奖励,{chips}筹码," };
			[55] = { a ="10024", b = "恭喜您于{date}在老虎机中获得{type}系统已自动发放{chips}筹码" };
			[56] = { a ="10025", b = "恭喜您获得玩偶奖励：{reward}" };
			[57] = { a ="83", b = "由于你报名的定时单桌赛未能正常开赛(报名人数不足5人)。系统已将报名费用{chips}退还到您的账户上。谢谢你对我们游戏的支持" };
			[58] = { a ="26", b = "您在昨天射手排行榜裡榮獲{rwdName}，獲得{chips}籌碼！" };
			[59] = { a ="110", b = "亲爱的玩家，您的账户在{date}有一笔异常退款记录，为了您的账号安全，我们暂时限制了您的账号，详细情况请及时反馈联系" };
			[60] = { a ="10099", b = "恭喜您获得新手教程奖励：筹码{chips}+经验{exp}+互动道具{functool}！" };
		};
		[11] = {
			id = "301",
			[1] = { a ="1", b = "【支付記錄】你於{date}日充值了{buyMoney}籌碼！" };
			[2] = { a ="2", b = "【支付記錄】你於{date}日充值了{buyCoalaa}金幣！" };
			[3] = { a ="10001", b = "您成功购买了{props}，请您注意查收。" };
			[4] = { a ="99", b = "对不起，您于{date}日支付的订单：{order} 未通过审批，已经退款，请前往【問題回報】將問題反饋于我們。謝謝！" };
			[5] = { a ="3", b = "【支付記錄】你於{date}日購買了{buyGoods}！" };
		};
		[12] = {
			id = "302",
			[1] = { a ="10001", b = "您的VIP还有{day}天即将到期。到期之后可能您将无法享受高人一等的登录奖励啦。" };
			[2] = { a ="10002", b = "您的VIP到期了，您的VIP特权暂时无法使用，我们期待您再次回归VIP大家庭" };
			[3] = { a ="10003", b = "你在活动{name}中，排名第{rank}，奖励内容如下：{reward}" };
			[4] = { a ="10004", b = "恭喜你在mtt賽事{name}中獲得第{rank}名,贏得{chips}籌碼和額外獎勵{desc}." };
			[5] = { a ="10005", b = "恭喜你獲得{name},充值序列號:{number}." };
			[6] = { a ="10006", b = "你报名參加的mtt賽事{name}，由於最终报名人數不足，系統已取消該比賽，报名费和服务费已经返还给你" };
			[7] = { a ="10007", b = "恭喜！您的好友{name}通過您的邀請成功註冊遊戲！您獲得{chip}籌碼的獎勵！" };
			[8] = { a ="20001", b = "親愛的{name}，您的{vip}将于{time}过期，现在续费，继续享受每日精彩特权。" , event = "1", eventTitle = "立即续费》"};
			[9] = { a ="20002", b = "親愛的{name}，您的{vip}已于{time}到期。您已失去{vipdesc}等特權，我們期待您的回歸！" , event = "1", eventTitle = "立即回歸》"};
		}
	};
	msgtitle = {
		[1] = {
			id = "-1",
			[1] = { a ="1", b = "标题,参数：{key1}{key2}" };
			[2] = { a ="2", b = "{name}" };

		}
	}
 }
 

 return MESSAGE_CONFIG;