--[Comment]
--荷官配置
local DealerConfig = {};

DealerConfig.DEALER_ID = "1:6,19:0,23:1001";--荷官id映射

DealerConfig.IN_ORDER = {
    1,
    19,
    23,
    3,
    22,
    2,
    17,
    4,
    5,
}

DealerConfig.CHANGEPOP_DELTAY = {
    [32] = -8, -- 维娜
    [31] = -8, --静姝
    [30] = -8, --冰冰
    [1] = -12,--伊
    [23] = -10,--维多利亚
    [3] = -10,--金恩珠
    [22] = 0,--玛利亚
    [19] = -10,--亚历山大
    [2] = -14,   --雪莉尔
    [17] = 0,--秋香
    [4] = 0,--安其拉
    [5] = -15,   --发哥
    [26] = -10, -- co gai ao dai
    [27] = -10, -- do thanh
};

DealerConfig.TABLE_DELTAY = {
    [32] = 0, -- 维娜
    [31] = 0, --静姝
    [30] = 0, --冰冰
    [1] = 0,
    [23] = 3,
    [3] = 4,
    [22] = 3,
    [19] = 5,
    [2] = -2,
    [17] = 6,
    [4] = 2,
    [5] = -6,
};

return DealerConfig


    -- [1] = -12,
    -- [23] = -10,
    -- [3] = -10,
    -- [22] = 0,
    -- [19] = -10,
    -- [2] = -10,
    -- [17] = 0,
    -- [4] = 0,
    -- [5] = -12,